In [44]:
import pandas as pd
from sqlalchemy import create_engine
import csv
df = pd.read_csv('/Users/hdvoor/Downloads/1NF_ABC_FOODMART.csv')

In [45]:
df

,location_name,address,city,state,zip_code,first_name,last_name,email,phone,position,...,address.1,quantity_sold,unit_price.1,transaction_type,amount,transaction_date,expense_date,expense_description,amount.1,quantity_on_shelf
0,Queens #1,123 Main St,Queens,NY,11111,John,Doe,john.doe@email.com,555-123-4567,Manager,...,"123 Main St, Apt 101",5,0.75,Debit,15.75,11/1/23,11/1/23,Utility Bill,500,100
1,Queens #2,456 Elm St,Queens,NY,22222,Jane,Smith,jane.smith@email.com,555-234-5678,Cashier,...,"456 Elm St, Apt 202",3,2.50,Debit,3.50,11/2/23,11/2/23,Cleaning Supplies,75,50
2,Brooklyn #1,789 Oak St,Brooklyn,NY,33333,Mike,Johnson,mike.johnson@email.com,555-345-6789,Cashier,...,"789 Oak St, Apt 303",2,1.75,Credit,45.75,11/2/23,11/3/23,Rent,1500,25
3,Brooklyn #2,101 Pine St,Brooklyn,NY,44444,Sarah,Lee,sarah.lee@email.com,555-456-7890,Manager,...,"101 Pine St, Apt 404",1,5.50,Debit,7.50,11/3/23,11/4/23,Advertising,250,20
4,Brooklyn #3,202 Maple St,Brooklyn,NY,55555,David,Brown,david.brown@email.com,555-567-8901,Cashier,...,"202 Maple St, Apt 505",4,1.25,Debit,75.00,11/4/23,11/5/23,Repairs,300,80

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 46 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location_name        5 non-null      object
 1   address              5 non-null      object
 2   city                 5 non-null      object
 3   state                5 non-null      object
 4   zip_code             5 non-null      int64
 5   first_name           5 non-null      object
 6   last_name            5 non-null      object
 7   email                5 non-null      object
 8   phone                5 non-null      object
 9   position             5 non-null      object
 10  date                 5 non-null      object
 11  shift_start_time     5 non-null      object
 12  shift_end_time       5 non-null      object
 13  hourly_wage          5 non-null      object
 14  item_name            5 non-null      object
 15  description          5 non-null      object
 16  category_name        5 non-null      object
 17  cost_price           5 non-null      float64
 18  retail_price         5 non-null      float64
 19  quantity_in_stock    5 non-null      int64
 20  supplier_name        5 non-null      object
 21  contact_name         5 non-null      object
 22  contact_phone        5 non-null      object
 23  contact_email        5 non-null      object
 24  delivery_date        5 non-null      object
 25  quantity_delivered   5 non-null      int64
 26  unit_price           5 non-null      float64
 27  sale_date            5 non-null      object
 28  total_amount         5 non-null      float64
 29  first_name.1         5 non-null      object
 30  last_name.1          5 non-null      object
 31  email.1              5 non-null      object
 32  phone.1              5 non-null      object
 33  address.1            5 non-null      object
 34  quantity_sold        5 non-null      int64
 35  unit_price.1         5 non-null      float64
 36  transaction_type     5 non-null      object
 37  amount               5 non-null      float64
 38  transaction_date     5 non-null      object
 39  expense_date         5 non-null      object
 40  expense_description  5 non-null      object
 41  amount.1             5 non-null      int64
 42  quantity_on_shelf    5 non-null      int64
 43  supplier_id          5 non-null      int64
 44  category_id          5 non-null      int64
 45  item_id              5 non-null      int64
dtypes: float64(6), int64(9), object(31)
memory usage: 1.8+ KB

In [47]:
#assign connection to variable
conn = 'postgresql://postgres:123@localhost/ABCFOODMART'

In [48]:
#create engine to connect to database
engine = create_engine(conn)

In [49]:
#connection
connection = engine.connect()

In [50]:
#SQL statements to create all tables in the schema
sql_statement = """
    CREATE TABLE locations (
        location_id INTEGER,
        location_name VARCHAR(50) NOT NULL,
        address VARCHAR(100) NOT NULL,
        city VARCHAR(50) NOT NULL,
        state CHAR(2) NOT NULL,
        zip_code CHAR(5),
        PRIMARY KEY (location_id));

    CREATE TABLE suppliers (
        supplier_id INTEGER,
        supplier_name VARCHAR(50) NOT NULL,
        contact_name VARCHAR(50) NOT NULL,
        contact_phone VARCHAR(20) NOT NULL,
        contact_email VARCHAR(100) NOT NULL,
        PRIMARY KEY (supplier_id));

    CREATE TABLE customers (
        customer_id INTEGER,
        first_name VARCHAR(20) NOT NULL,
        last_name VARCHAR(20) NOT NULL,
        email VARCHAR(100) NOT NULL,
        phone VARCHAR(20) NOT NULL,
        address VARCHAR(100) NOT NULL,
        PRIMARY KEY (customer_id));

    CREATE TABLE categories (
        category_id INTEGER,
        category_name VARCHAR NOT NULL,
        PRIMARY KEY (category_id));

    CREATE TABLE employees (
        employee_id INTEGER,
        first_name VARCHAR(20) NOT NULL,
        last_name VARCHAR(20) NOT NULL,
        email VARCHAR(100) NOT NULL,
        phone VARCHAR(20) NOT NULL,
        position VARCHAR(50) NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE inventory_items (
        item_id INTEGER,
        item_name VARCHAR(50) NOT NULL,
        description TEXT NOT NULL,
        category_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        cost_price DECIMAL(4,2) NOT NULL,
        retail_price DECIMAL(4,2) NOT NULL,
        quantity_in_stock INTEGER NOT NULL,
        PRIMARY KEY (item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id),
        FOREIGN KEY (category_id) REFERENCES categories(category_id));


    CREATE TABLE deliveries (
        delivery_id INTEGER,
        item_id INTEGER NOT NULL,
        supplier_id INTEGER NOT NULL,
        delivery_date DATE NOT NULL,
        quantity_delivered INTEGER NOT NULL,
        unit_price DECIMAL(6,2) NOT NULL,
        PRIMARY KEY (delivery_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id),
        FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id));

    CREATE TABLE sales (
        sale_id INTEGER,
        employee_id INTEGER NOT NULL,
        sale_date DATE NOT NULL,
        total_amount DECIMAL(6,2) NOT NULL,
        location_id INTEGER NOT NULL,
        PRIMARY KEY (sale_id),
        FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));


    CREATE TABLE transactions (
        transaction_id INTEGER,
        sale_id INTEGER NOT NULL,
        customer_id INTEGER NOT NULL,
        PRIMARY KEY (transaction_id),
        FOREIGN KEY (sale_id) REFERENCES sales(sale_id),
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

    CREATE TABLE transaction_items (
        transaction_item_id INTEGER,
        transaction_id INTEGER NOT NULL,
        item_id INTEGER NOT NULL,
        quantity_sold SMALLINT NOT NULL,
        unit_price DECIMAL(6, 2) NOT NULL,
        PRIMARY KEY (transaction_item_id),
        FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id));

    CREATE TABLE accounting (
        accounting_id INTEGER,
        transaction_id INTEGER NOT NULL,
        transaction_type CHAR(6) NOT NULL,
        amount DECIMAL(8, 2) NOT NULL,
        transaction_date DATE NOT NULL,
        PRIMARY KEY (accounting_id),
        FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
        CHECK (transaction_type IN ('debit', 'credit')));

    CREATE TABLE expenses (
        expense_id INTEGER,
        location_id INTEGER NOT NULL,
        expenses_date DATE NOT NULL,
        expenses_description VARCHAR NOT NULL,
        amount DECIMAL(8, 2) NOT NULL,
        PRIMARY KEY (expense_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE shelves (
        shelf_id INTEGER,
        location_id INTEGER NOT NULL,
        shelf_name VARCHAR NOT NULL,
        PRIMARY KEY (shelf_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id));

    CREATE TABLE shelf_contents (
        shelf_content_id INTEGER,
        shelf_id INTEGER NOT NULL,
        item_id INTEGER NOT NULL,
        quantity_on_shelf SMALLINT NOT NULL,
        PRIMARY KEY (shelf_content_id),
        FOREIGN KEY (shelf_id) REFERENCES shelves(shelf_id),
        FOREIGN KEY (item_id) REFERENCES inventory_items(item_id));

    CREATE TABLE employee_shifts (
        employee_id INTEGER,
        location_id INTEGER NOT NULL,
        accounting_id INTEGER NOT NULL,
        date DATE NOT NULL,
        shift_end_time TIME NOT NULL,
        shift_start_time TIME NOT NULL,
        hourly_wage DECIMAL(6,2) NOT NULL,
        PRIMARY KEY (employee_id),
        FOREIGN KEY (location_id) REFERENCES locations(location_id),
        FOREIGN KEY (accounting_id) REFERENCES accounting(accounting_id));
"""

In [51]:
#execute sql statement above
connection.execute(sql_statement)

In [61]:
#create suppliers df
suppliers = df[['supplier_name']].drop_duplicates()
suppliers = suppliers.dropna(subset=['supplier_name'])
suppliers = df[['supplier_name', 'contact_name','contact_phone','contact_email']]
suppliers.insert(0,'supplier_id',range(1,1+len(suppliers)))
suppliers

,supplier_id,supplier_name,contact_name,contact_phone,contact_email
0,1,Fresh Farms,John Supplier,555-111-1111,john@freshfarms.com
1,2,Dairy Delights,Mary Contact,555-222-2222,mary@dairydelights.com
2,3,Golden Bakery,Robert Baker,555-333-3333,robert@goldenbakery.com
3,4,Quality Meats,Susan Meats,555-444-4444,susan@qualitymeats.com
4,5,Veggie World,Mark Green,555-555-5555,mark@veggieworld.com

In [32]:
#push suppliers df to sql
suppliers.to_sql('suppliers',con=engine, if_exists='append', index=False)

5

In [69]:
#create categories df
categories = df[['category_name']].drop_duplicates()
categories = categories.dropna(subset='category_name')
categories.insert(0,'category_id',range(1,1+len(categories)))
categories

   category_id category_name
0            1        Fruits
1            2         Dairy
2            3        Bakery
3            4          Meat
4            5    Vegetables

In [ ]:
#push categories df to sql
categories.to_sql('categories',con=engine, if_exists='append', index=False)

In [96]:
#create inventory_items df
inventory_items = df[['item_name']].drop_duplicates()
inventory_items = inventory_items.dropna(subset=['item_name'])
#df = pd.merge(df, suppliers[['supplier_id','supplier_name']],how='left',on='supplier_name')
#df = pd.merge(df, categories[['category_id','category_name']],how = 'left',on='category_name')
inventory_items = df[['item_name','description','category_id','supplier_id','cost_price','retail_price','quantity_in_stock']]
inventory_items.insert(0,'item_id',range(1,1+len(inventory_items)))
inventory_items

,item_id,item_name,description,category_id,supplier_id,cost_price,retail_price,quantity_in_stock
0,1,Apples,Fresh red apples,1,1,0.50,0.75,1000
1,2,Milk,Fresh whole milk,2,2,2.00,2.50,500
2,3,Bread,Whole wheat bread,3,3,1.25,1.75,300
3,4,Chicken,Boneless chicken,4,4,4.00,5.50,200
4,5,Lettuce,Fresh green lettuce,5,5,0.75,1.25,800

In [94]:
#remove = ['category_id_x','category_id_y','supplier_id_x','supplier_id_y']
#df = df.drop(columns=remove)

In [ ]:
#push inventory_items df to sql
inventory_items.to_sql('inventory_items',con=engine, if_exists='append', index=False)

In [103]:
#create deliveries df
#df = pd.merge(df, inventory_items[['item_id','item_name']],how='left',on='item_name')
deliveries = df[['item_id','supplier_id','delivery_date','quantity_delivered','unit_price']]
deliveries.insert(0,'delivery_id',range(1,1+len(deliveries)))
deliveries

,delivery_id,item_id,supplier_id,delivery_date,quantity_delivered,unit_price
0,1,1,1,11/1/23,1000,0.45
1,2,2,2,11/2/23,500,1.90
2,3,3,3,11/3/23,300,1.10
3,4,4,4,11/4/23,200,3.75
4,5,5,5,11/5/23,800,0.70

In [ ]:
#push deliveries df to sql
deliveries.to_sql('deliveries',con=engine, if_exists='append', index=False)

In [36]:
#create expenses df
expenses = df[['expense_id','location_id','expense_date','expense_description','amount']]
expenses

   expense_id  location_id expense_date expense_description  amount
0           1            1      11/1/23        Utility Bill   15.75
1           2            2      11/2/23   Cleaning Supplies    3.50
2           3            3      11/3/23                Rent   45.75
3           4            4      11/4/23         Advertising    7.50
4           5            5      11/5/23             Repairs   75.00

In [ ]:
#push expenses df to sql
expenses.to_sql('expenses',con=engine, if_exists='append', index=False)